# Lesson 029 - Set Methods Part Three
# Video: https://www.youtube.com/watch?v=rs9eebZpcaE

# -----------------
# -- Set Methods --
# -----------------

# issuperset() -> بترجع صح أو خطأ : بفحص هل كل العناصر الي في المجموعة الثانية موجودة زيها في المجموعة الأصلية

a = {1, 2, 3, 4}
b = {1, 2, 3}
c = {1, 2, 3, 4, 5}

print(a.issuperset(b)) # True -> صح كل العناصر الي في المجموعة الثانية موجود مثلها في المجموعة الأولى
print(a.issuperset(c)) # False -> مش كل العناصر الي في المجموعة الثالثة موجود زيها في المجموعة الأولى

# issubset() -> بفحص هل كل العناصر الي في المجموعة الأصلية موجود زيها في المجموعة الثانية

d = {1, 2, 3, 4}
e = {1, 2, 3}
f = {1, 2, 3, 4, 5}

print(d.issubset(e)) # False -> مش كل العناصر الي في المجموعة الأولى موجود زيها في المجموعة الثانية
print(d.issubset(f)) # True -> أه كل العناصر الي في المجموعة الأولى موجودة زيها في المجموعة الثالثة 

# isdisjoint() -> هل المجموعتين مختلفتين بشكل كامل عن بعض ولا في عناصر متشابه

g = {1, 2, 3, 4}
h = {1, 2, 3}
i = {11, 12}

print(g.isdisjoint(h)) # False -> في عناصر متشابة بين المجموعتين
print(g.isdisjoint(i)) # True -> لا يوجد أي عنصر متشابة بين المجموعتين

