# Lesson 095 - Regular Expressions Part 1 Intro
# Video: https://www.youtube.com/watch?v=QrYB2S1IZKo

# ----------------------------------
# -- Regular Expressions => Intro --
# ----------------------------------
# [1] Sequence of Characters That Define A Search Pattern
# [2] Regular Expression is Not In Python Its General Concept
# [3] Used In [Credit Card Validation, IP Address Validation, Email Validation]
# [4] Test RegEx "https://pythex.org/"
# [5] Characters Sheet "https://www.debuggex.com/cheatsheet/regex/python"
# -----------------------------------------------------------

import re

my_text = """
Hello Iam Mohammed Mohsen From Web School
My Number Is 00123456789012
My Email Is user.name2024@example.com
#%^^$%@!#$%^^%&
213 64567 875 43522 334 5
"""

my_search = re.findall(r'\d',my_text) # بعمل ماتش مع الأرقام فقط 

# print(my_search)

# ['0', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '1', '2',
#  '2', '0', '2', '4', '2', '1', '3', '6', '4', '5', '6', '7', '8', '7',
#  '5', '4', '3', '5', '2', '2', '3', '3', '4', '5']

my_search = re.findall(r'\D',my_text) # بعمل ماتش مع كل شيئ ما عدا الأرقام

# print(my_search)

# ['\n', 'H', 'e', 'l', 'l', 'o', ' ', 'I', 'a', 'm', ' ', 'M', 'o', 'h',
#  'a', 'm', 'm', 'e', 'd', ' ', 'M', 'o', 'h', 's', 'e', 'n', ' ', 'F',
#  'r', 'o', 'm', ' ', 'W', 'e', 'b', ' ', 'S', 'c', 'h', 'o', 'o', 'l',
#  '\n', 'M', 'y', ' ', 'N', 'u', 'm', 'b', 'e', 'r', ' ', 'I', 's', ' ',
#  '\n', 'M', 'y', ' ', 'E', 'm', 'a', 'i', 'l', ' ', 'I', 's', ' ', 'u',
#  's', 'e', 'r', '.', 'n', 'a', 'm', 'e', '@', 'e', 'x', 'a', 'm', 'p',
#  'l', 'e', '.', 'c', 'o', 'm', '\n', '#', '%', '^', '^', '$', '%', '@',
#  '!', '#', '$', '%', '^', '^', '%', '&', '\n', ' ', ' ', ' ', ' ', ' ',
#  '\n']

my_search = re.findall(r'\s',my_text) # بعمل ماتش مع جميع المسافات والأسطر الجديدة

# print(my_search)

# ['\n', ' ', ' ', ' ', ' ', ' ', ' ', '\n', ' ', ' ', ' ', '\n', ' ', ' ', ' ', '\n', '\n', ' ', ' ', ' ', ' ', ' ', '\n']

my_search = re.findall(r'\S',my_text) # بعمل ماتش مع كل شيئ ما عدا المسافات

# print(my_search)

# ['H', 'e', 'l', 'l', 'o', 'I', 'a', 'm', 'M', 'o', 'h', 'a', 'm', 'm',
#  'e', 'd', 'M', 'o', 'h', 's', 'e', 'n', 'F', 'r', 'o', 'm', 'W', 'e',
#  'b', 'S', 'c', 'h', 'o', 'o', 'l', 'M', 'y', 'N', 'u', 'm', 'b', 'e',
#  'r', 'I', 's', '0', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
#  '0', '1', '2', 'M', 'y', 'E', 'm', 'a', 'i', 'l', 'I', 's', 'u', 's',
#  'e', 'r', '.', 'n', 'a', 'm', 'e', '2', '0', '2', '4', '@', 'e', 'x',
#  'a', 'm', 'p', 'l', 'e', '.', 'c', 'o', 'm', '#', '%', '^', '^', '$',
#  '%', '@', '!', '#', '$', '%', '^', '^', '%', '&', '2', '1', '3', '6',
#  '4', '5', '6', '7', '8', '7', '5', '4', '3', '5', '2', '2', '3', '3',
#  '4', '5']

my_search = re.findall(r'\w',my_text) # بعمل ماتش مع الأحرف والأرقام فقط

# print(my_search)

# ['H', 'e', 'l', 'l', 'o', 'I', 'a', 'm', 'M', 'o', 'h', 'a', 'm', 'm',
#  'e', 'd', 'M', 'o', 'h', 's', 'e', 'n', 'F', 'r', 'o', 'm', 'W', 'e',
#  'b', 'S', 'c', 'h', 'o', 'o', 'l', 'M', 'y', 'N', 'u', 'm', 'b', 'e',
#  'r', 'I', 's', '0', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
#  '0', '1', '2', 'M', 'y', 'E', 'm', 'a', 'i', 'l', 'I', 's', 'u', 's',
#  'e', 'r', 'n', 'a', 'm', 'e', '2', '0', '2', '4', 'e', 'x', 'a', 'm',
#  'p', 'l', 'e', 'c', 'o', 'm', '2', '1', '3', '6', '4', '5', '6', '7',
#  '8', '7', '5', '4', '3', '5', '2', '2', '3', '3', '4', '5']

my_search = re.findall(r'\W',my_text) # بعمل ماتش مع كل شيئ ما عدا الأحرف والأرقام

# print(my_search)

# ['\n', ' ', ' ', ' ', ' ', ' ', ' ', '\n', ' ', ' ', ' ', '\n', ' ', ' ',
#  ' ', '.', '@', '.', '\n', '#', '%', '^', '^', '$', '%', '@', '!', '#',
#  '$', '%', '^', '^', '%', '&', '\n', ' ', ' ', ' ', ' ', ' ', '\n']

# ===============================================================

my_search = re.findall(r'\d\d',my_text) # بعمل ماتش مع رقمين ورى بعض او مع بعض

# print(my_search) # لاحظ في هو بشوف رقمين مع بعض , لو كانو ثلاثة هياخذ فقط اول اثنين لانو الثالث لا يأتي بعدو رقم ليطابق الماتش

# ['00', '12', '34', '56', '78', '90', '12', '20', '24', '21', '64', '56', '87', '43', '52', '33']

# -------------------------------

my_search = re.findall(r'\d\d\d',my_text) # ماتش مع ثلاث ارقام ورى بعض

# print(my_search) 

# ['001', '234', '567', '890', '202', '213', '645', '875', '435', '334']

my_search = re.findall(r'\d\s',my_text) # بعمل ماتش مع رقم ورى مسافة او سطر جديد

# print(my_search)

# ['2\n', '3 ', '7 ', '5 ', '2 ', '4 ', '5\n']

# ---------------------------------

my_search = re.findall(r'.',my_text) # بعمل مع كل شيئ ما عدا الأسطر الجديدة

print(my_search)

# ---------------------------------

# وهناك اوامر كثيرة زور الموقع لتعرف عليها
